from aiogram import types
from aiogram.types import CallbackQuery
from config import version

async def help_handler(call: CallbackQuery):
    text = (
        f"👋 Привет! Ты в SATM — Search Around The Marketplace\n\n"
        f"💲 Твой персональный агрегатор для умного шопинга. Больше не нужно открывать десяток вкладок, чтобы сравнить цены!\n\n"
        f"❔ Что я умею: 🔎 Мгновенный поиск — нахожу товары на топовых маркетплейсах прямо здесь, в Telegram.\n"
        f"🚀 Экономия времени — выдаю список лучших предложений в одном сообщении.\n"
        f"📊 История запросов — всегда помню, что ты искал ранее.\n\n"
        f"🕹 Управление: Используй кнопки меню для навигации. Если меню потерялось — просто введи команду /start.\n"
        f"💎 Версия: {version} 🙏 Бот активно развивается. Заметил баг или хочешь поддержать проект? Пиши создателю: @saylormo0n\n"
    )
    
    await call.message.answer(text)
    
    await call.answer()
