from aiogram.types import Message
from keyboards.main_menu import get_start_keyboard, main_menu

async def start_handler(message: Message):
    welcome_text = (
        "👋 <b>Привет! Ты в SATM — Search Around The Marketplace</b>\n\n"
        "🚩 <b>Твой личный агрегатор маркетплейсов.</b>\n"
        "Больше не нужно переключаться между приложениями — я найду лучшие предложения за тебя!\n\n"
        "🔎 <b>Что я умею:</b>\n"
        "• Мгновенный поиск товаров на WB и других площадках.\n"
        "• Сохранение истории твоих запросов.\n"
        "• Прямые ссылки на самые выгодные позиции.\n\n"
        "Каждый день выдается 20 запросов, сделано это для того что-бы не перегружать бота, этого хватит для самого активного шопинга! \n\n"
        "💎 <i>Версия: 1.0 </i>\n"
        "🙏 Поддержать проект: @saylormo0n\n\n"
        "<b>Нажми кнопку ниже 📱 МЕНЮ, чтобы начать!</b>"
    )
    await message.answer(welcome_text, reply_markup=get_start_keyboard())

async def menu_handler(message: Message):
    await message.answer(
        "📍 <b>Главное меню:</b>",
        reply_markup=main_menu()
    )